In [12]:
import pandas as pd 

df1 = pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]], index = ["g1","g2", "g3"], columns = ["s1", "s2", "s3"])
df1

    s1  s2  s3
g1   1   2   3
g2   4   5   6
g3   7   8   9

In [14]:
df2 = pd.DataFrame([[11,20],[40,50],[70,80]], index = ["g1","g2", "g4"], columns = ["exon_no", "length"])
df2

    exon_no  length
g1       11      20
g2       40      50
g4       70      80

In [16]:
df1.join(df2)

    s1  s2  s3  exon_no  length
g1   1   2   3     11.0    20.0
g2   4   5   6     40.0    50.0
g3   7   8   9      NaN     NaN

In [20]:
df1.join(df2, how = "right")

     s1   s2   s3  exon_no  length
g1  1.0  2.0  3.0       11      20
g2  4.0  5.0  6.0       40      50
g4  NaN  NaN  NaN       70      80

In [22]:
df1.join(df2, how = "inner")

    s1  s2  s3  exon_no  length
g1   1   2   3       11      20
g2   4   5   6       40      50

In [24]:
df1.join(df2, how = "outer")

     s1   s2   s3  exon_no  length
g1  1.0  2.0  3.0     11.0    20.0
g2  4.0  5.0  6.0     40.0    50.0
g3  7.0  8.0  9.0      NaN     NaN
g4  NaN  NaN  NaN     70.0    80.0

In [8]:
import pandas as pd
df1 = pd.DataFrame([[1,2,3, "g1"],[4,5,6, "g2"],[7,8,9, "g3"]], columns = ["s1", "s2", "s3", "g"])
df2 = pd.DataFrame([[11,20,"g1"],[40,50,"g2"],[70,80,"g4"]], columns = ["exon_no", "length", "g"])

In [10]:
df1

   s1  s2  s3   g
0   1   2   3  g1
1   4   5   6  g2
2   7   8   9  g3

In [13]:
df2

   exon_no  length   g
0       11      20  g1
1       40      50  g2
2       70      80  g4

In [21]:
df1.merge(df2, how = "left", indicator = True)

   s1  s2  s3   g  exon_no  length     _merge
0   1   2   3  g1     11.0    20.0       both
1   4   5   6  g2     40.0    50.0       both
2   7   8   9  g3      NaN     NaN  left_only

In [40]:
df1.merge?

Signature:
df1.merge(
    right: 'DataFrame | Series',
    how: 'MergeHow' = 'inner',
    on: 'IndexLabel | AnyArrayLike | None' = None,
    left_on: 'IndexLabel | AnyArrayLike | None' = None,
    right_on: 'IndexLabel | AnyArrayLike | None' = None,
    left_index: 'bool' = False,
    right_index: 'bool' = False,
    sort: 'bool' = False,
    suffixes: 'Suffixes' = ('_x', '_y'),
    copy: 'bool | None' = None,
    indicator: 'str | bool' = False,
    validate: 'MergeValidate | None' = None,
) -> 'DataFrame'
Docstring:
Merge DataFrame or named Series objects with a database-style join.

A named Series object is treated as a DataFrame with a single named column.

The join is done on columns or indexes. If joining columns on
columns, the DataFrame indexes *will be ignored*. Otherwise if joining indexes
on indexes or indexes on a column or columns, the index will be passed on.
When performing a cross merge, no column specifications to merge on are
allowed.

.. warning::

    If both key columns contain rows where the key is a null value, those
    rows will be matched against each other. This is different from usual SQL
    join behaviour and can lead to unexpected results.

Parameters
----------
right : DataFrame or named Series
    Object to merge with.
how : {'left', 'right', 'outer', 'inner', 'cross'}, default 'inner'
    Type of merge to be performed.

    * left: use only keys from left frame, similar to a SQL left outer join;
      preserve key order.
    * right: use only keys from right frame, similar to a SQL right outer join;
      preserve key order.
    * outer: use union of keys from both frames, similar to a SQL full outer
      join; sort keys lexicographically.
    * inner: use intersection of keys from both frames, similar to a SQL inner
      join; preserve the order of the left keys.
    * cross: creates the cartesian product from both frames, preserves the order
      of the left keys.
on : label or list
    Column or index level names to join on. These must be found in both
    DataFrames. If `on` is None and not merging on indexes then this defaults
    to the intersection of the columns in both DataFrames.
left_on : label or list, or array-like
    Column or index level names to join on in the left DataFrame. Can also
    be an array or list of arrays of the length of the left DataFrame.
    These arrays are treated as if they are columns.
right_on : label or list, or array-like
    Column or index level names to join on in the right DataFrame. Can also
    be an array or list of arrays of the length of the right DataFrame.
    These arrays are treated as if they are columns.
left_index : bool, default False
    Use the index from the left DataFrame as the join key(s). If it is a
    MultiIndex, the number of keys in the other DataFrame (either the index
    or a number of columns) must match the number of levels.
right_index : bool, default False
    Use the index from the right DataFrame as the join key. Same caveats as
    left_index.
sort : bool, default False
    Sort the join keys lexicographically in the result DataFrame. If False,
    the order of the join keys depends on the join type (how keyword).
suffixes : list-like, default is ("_x", "_y")
    A length-2 sequence where each element is optionally a string
    indicating the suffix to add to overlapping column names in
    `left` and `right` respectively. Pass a value of `None` instead
    of a string to indicate that the column name from `left` or
    `right` should be left as-is, with no suffix. At least one of the
    values must not be None.
copy : bool, default True
    If False, avoid copy if possible.

    .. note::
        The `copy` keyword will change behavior in pandas 3.0.
        `Copy-on-Write
        <https://pandas.pydata.org/docs/dev/user_guide/copy_on_write.html>`__
        will be enabled by default, which means that all methods with a
        `copy` keyword will use a lazy copy mechanism to defer the copy and
        ignore the `copy` keyword. The `copy` keyword will be removed in a
        future version of pandas.

        You can already get the future behavior and improvements through
        enabling copy on write ``pd.options.mode.copy_on_write = True``
indicator : bool or str, default False
    If True, adds a column to the output DataFrame called "_merge" with
    information on the source of each row. The column can be given a different
    name by providing a string argument. The column will have a Categorical
    type with the value of "left_only" for observations whose merge key only
    appears in the left DataFrame, "right_only" for observations
    whose merge key only appears in the right DataFrame, and "both"
    if the observation's merge key is found in both DataFrames.

validate : str, optional
    If specified, checks if merge is of specified type.

    * "one_to_one" or "1:1": check if merge keys are unique in both
      left and right datasets.
    * "one_to_many" or "1:m": check if merge keys are unique in left
      dataset.
    * "many_to_one" or "m:1": check if merge keys are unique in right
      dataset.
    * "many_to_many" or "m:m": allowed, but does not result in checks.

Returns
-------
DataFrame
    A DataFrame of the two merged objects.

See Also
--------
merge_ordered : Merge with optional filling/interpolation.
merge_asof : Merge on nearest keys.
DataFrame.join : Similar method using indices.

Examples
--------
>>> df1 = pd.DataFrame({'lkey': ['foo', 'bar', 'baz', 'foo'],
...                     'value': [1, 2, 3, 5]})
>>> df2 = pd.DataFrame({'rkey': ['foo', 'bar', 'baz', 'foo'],
...                     'value': [5, 6, 7, 8]})
>>> df1
    lkey value
0   foo      1
1   bar      2
2   baz      3
3   foo      5
>>> df2
    rkey value
0   foo      5
1   bar      6
2   baz      7
3   foo      8

Merge df1 and df2 on the lkey and rkey columns. The value columns have
the default suffixes, _x and _y, appended.

>>> df1.merge(df2, left_on='lkey', right_on='rkey')
  lkey  value_x rkey  value_y
0  foo        1  foo        5
1  foo        1  foo        8
2  bar        2  bar        6
3  baz        3  baz        7
4  foo        5  foo        5
5  foo        5  foo        8

Merge DataFrames df1 and df2 with specified left and right suffixes
appended to any overlapping columns.

>>> df1.merge(df2, left_on='lkey', right_on='rkey',
...           suffixes=('_left', '_right'))
  lkey  value_left rkey  value_right
0  foo           1  foo            5
1  foo           1  foo            8
2  bar           2  bar            6
3  baz           3  baz            7
4  foo           5  foo            5
5  foo           5  foo            8

Merge DataFrames df1 and df2, but raise an exception if the DataFrames have
any overlapping columns.

>>> df1.merge(df2, left_on='lkey', right_on='rkey', suffixes=(False, False))
Traceback (most recent call last):
...
ValueError: columns overlap but no suffix specified:
    Index(['value'], dtype='object')

>>> df1 = pd.DataFrame({'a': ['foo', 'bar'], 'b': [1, 2]})
>>> df2 = pd.DataFrame({'a': ['foo', 'baz'], 'c': [3, 4]})
>>> df1
      a  b
0   foo  1
1   bar  2
>>> df2
      a  c
0   foo  3
1   baz  4

>>> df1.merge(df2, how='inner', on='a')
      a  b  c
0   foo  1  3

>>> df1.merge(df2, how='left', on='a')
      a  b  c
0   foo  1  3.0
1   bar  2  NaN

>>> df1 = pd.DataFrame({'left': ['foo', 'bar']})
>>> df2 = pd.DataFrame({'right': [7, 8]})
>>> df1
    left
0   foo
1   bar
>>> df2
    right
0   7
1   8

>>> df1.merge(df2, how='cross')
   left  right
0   foo      7
1   foo      8
2   bar      7
3   bar      8
File:      /opt/anaconda3/lib/python3.12/site-packages/pandas/core/frame.py
Type:      method

In [18]:
df1.join?

Signature:
df1.join(
    other: 'DataFrame | Series | Iterable[DataFrame | Series]',
    on: 'IndexLabel | None' = None,
    how: 'MergeHow' = 'left',
    lsuffix: 'str' = '',
    rsuffix: 'str' = '',
    sort: 'bool' = False,
    validate: 'JoinValidate | None' = None,
) -> 'DataFrame'
Docstring:
Join columns of another DataFrame.

Join columns with `other` DataFrame either on index or on a key
column. Efficiently join multiple DataFrame objects by index at once by
passing a list.

Parameters
----------
other : DataFrame, Series, or a list containing any combination of them
    Index should be similar to one of the columns in this one. If a
    Series is passed, its name attribute must be set, and that will be
    used as the column name in the resulting joined DataFrame.
on : str, list of str, or array-like, optional
    Column or index level name(s) in the caller to join on the index
    in `other`, otherwise joins index-on-index. If multiple
    values given, the `other` DataFrame must have a MultiIndex. Can
    pass an array as the join key if it is not already contained in
    the calling DataFrame. Like an Excel VLOOKUP operation.
how : {'left', 'right', 'outer', 'inner', 'cross'}, default 'left'
    How to handle the operation of the two objects.

    * left: use calling frame's index (or column if on is specified)
    * right: use `other`'s index.
    * outer: form union of calling frame's index (or column if on is
      specified) with `other`'s index, and sort it lexicographically.
    * inner: form intersection of calling frame's index (or column if
      on is specified) with `other`'s index, preserving the order
      of the calling's one.
    * cross: creates the cartesian product from both frames, preserves the order
      of the left keys.
lsuffix : str, default ''
    Suffix to use from left frame's overlapping columns.
rsuffix : str, default ''
    Suffix to use from right frame's overlapping columns.
sort : bool, default False
    Order result DataFrame lexicographically by the join key. If False,
    the order of the join key depends on the join type (how keyword).
validate : str, optional
    If specified, checks if join is of specified type.

    * "one_to_one" or "1:1": check if join keys are unique in both left
      and right datasets.
    * "one_to_many" or "1:m": check if join keys are unique in left dataset.
    * "many_to_one" or "m:1": check if join keys are unique in right dataset.
    * "many_to_many" or "m:m": allowed, but does not result in checks.

    .. versionadded:: 1.5.0

Returns
-------
DataFrame
    A dataframe containing columns from both the caller and `other`.

See Also
--------
DataFrame.merge : For column(s)-on-column(s) operations.

Notes
-----
Parameters `on`, `lsuffix`, and `rsuffix` are not supported when
passing a list of `DataFrame` objects.

Examples
--------
>>> df = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3', 'K4', 'K5'],
...                    'A': ['A0', 'A1', 'A2', 'A3', 'A4', 'A5']})

>>> df
  key   A
0  K0  A0
1  K1  A1
2  K2  A2
3  K3  A3
4  K4  A4
5  K5  A5

>>> other = pd.DataFrame({'key': ['K0', 'K1', 'K2'],
...                       'B': ['B0', 'B1', 'B2']})

>>> other
  key   B
0  K0  B0
1  K1  B1
2  K2  B2

Join DataFrames using their indexes.

>>> df.join(other, lsuffix='_caller', rsuffix='_other')
  key_caller   A key_other    B
0         K0  A0        K0   B0
1         K1  A1        K1   B1
2         K2  A2        K2   B2
3         K3  A3       NaN  NaN
4         K4  A4       NaN  NaN
5         K5  A5       NaN  NaN

If we want to join using the key columns, we need to set key to be
the index in both `df` and `other`. The joined DataFrame will have
key as its index.

>>> df.set_index('key').join(other.set_index('key'))
      A    B
key
K0   A0   B0
K1   A1   B1
K2   A2   B2
K3   A3  NaN
K4   A4  NaN
K5   A5  NaN

Another option to join using the key columns is to use the `on`
parameter. DataFrame.join always uses `other`'s index but we can use
any column in `df`. This method preserves the original DataFrame's
index in the result.

>>> df.join(other.set_index('key'), on='key')
  key   A    B
0  K0  A0   B0
1  K1  A1   B1
2  K2  A2   B2
3  K3  A3  NaN
4  K4  A4  NaN
5  K5  A5  NaN

Using non-unique key values shows how they are matched.

>>> df = pd.DataFrame({'key': ['K0', 'K1', 'K1', 'K3', 'K0', 'K1'],
...                    'A': ['A0', 'A1', 'A2', 'A3', 'A4', 'A5']})

>>> df
  key   A
0  K0  A0
1  K1  A1
2  K1  A2
3  K3  A3
4  K0  A4
5  K1  A5

>>> df.join(other.set_index('key'), on='key', validate='m:1')
  key   A    B
0  K0  A0   B0
1  K1  A1   B1
2  K1  A2   B1
3  K3  A3  NaN
4  K0  A4   B0
5  K1  A5   B1
File:      /opt/anaconda3/lib/python3.12/site-packages/pandas/core/frame.py
Type:      method

## SQL - Major SQL commands
### BIOINF 575

##### RESOURCES
https://sqlite.org/index.html    
https://www.sqlite.org/fullsql.html  
https://docs.python.org/3/library/sqlite3.html  
https://www.sqlite.org/lang_aggfunc.html  
https://www.sqlitetutorial.net/sqlite-create-table/    
https://www.sqlite.org/syntaxdiagrams.html    
https://www.tutorialspoint.com/python_network_programming/python_databases_and_sql.htm  
https://www.tutorialspoint.com/python/python_database_access.htm  
https://www.python-course.eu/sql_python.php  
https://www.sqlalchemy.org/library.html#reference    
https://docs.sqlalchemy.org/en/13/orm/  
https://docs.sqlalchemy.org/en/14/orm/tutorial.html#version-check  
https://towardsdatascience.com/sql-in-python-for-beginners-b9a4f9293ecf  
https://database.guide/2-sample-databases-sqlite/
https://www.sqlitetutorial.net/sqlite-sample-database/

#### What is a database? 

* Is an organized collection of data (files)
* A way to store and retrieve that information
* A relational database is structured to recognize relations between the data elements


*  A collection of data

        * Dictionary
            {"EGFR":6.8, "MYC": 4.5, "WNT1":11.7}

        * Tab-separated text file, or pd.DataFrame


| GeneID  | GeneSymbol  | ExpressionValue  |
|---------|-------------|------------------|
| 7471    | WNT1        |             11.7 |
| 4609    | MYC         |              4.5 |
| 1956    | EGFR        |              6.8 |


Entity-Relationship Diagram - shows the relations between tables in a relational database
- tables are connected by fields (columns) that are common - called keys


https://upload.wikimedia.org/wikipedia/commons/b/b8/Sql_hospital.png


<img src = https://upload.wikimedia.org/wikipedia/commons/b/b8/Sql_hospital.png  width = 700 />

Relationship diagram as shown by the Relational Database Management Systems (RDBM)

https://dcm.uhcl.edu/yue/courses/joinDB/fall2024/notes/toyu/toyu.html

<img src = https://dcm.uhcl.edu/yue/courses/joinDB/fall2024/notes/toyu/toyu_er_workbench.jpg  width = 600 />



More examples:

https://www.sqlitetutorial.net/wp-content/uploads/2015/11/sqlite-sample-database-color.jpg      
https://upload.wikimedia.org/wikipedia/commons/b/b8/Sql_hospital.png      
https://www.researchgate.net/profile/Adam_Richards3/publication/282134102/figure/fig3/AS:289128232046602@1445944950296/Database-entity-diagram-Data-collected-from-NCBI-the-Gene-Ontology-and-UniProt-are.png      




#### Relational Database Management Systems (RDBMS)
* Software programs such as Oracle, MySQL, SQLServer, DB2, postgreSQL, SQLite 
* They handle the data storage, indexing, logging, tracking and security (access)  
* They have a very fine-grained way of granting permissions to users at the level of commands that may be used
    * Create a database
    * Create a table
    * Update or insert data
    * View certain tables ... and many more   
* An important part of learning databases is to understand the type of data which is stored in columns and rows.  
* Likewise when we get to the database design section, it is critically important to know what type of data you will be modeling and storing (and roughly how much, in traditional systems) 
* Exactly which types are available depends on the database system



#### Why use databases and Relational Database Management Systems?
* Easy, efficient, secure, collaborative management of data that maintains data integrity

#### What is the Structured Query Language (SQL) ?
* SQL is the standard language for relational database management systems
* SQL is used to communicate with a database

#### Why SQLite?
SQLite is a C library that provides a lightweight disk-based database that doesn’t require a separate server process and allows accessing the database using a nonstandard variant of the SQL query language. Some applications can use SQLite for internal data storage. 
* SQLite is often the technology of choice for small applications, particularly those of embedded systems and devices like phones and tablets, smart appliances, and instruments.
* It’s also possible to prototype an application using SQLite and then port the code to a larger database such as PostgreSQL or Oracle.

#### Integrated Development Environment (IDE)

There are many tools:      
##### https://dbeaver.io - recommended, please install it for the next session

<img src = https://github.com/dbeaver/dbeaver/wiki/images/ug/SQL-Editor.png width = 600/>

https://github.com/dbeaver/dbeaver/wiki/SQL-Editor

Other IDE tools:    
https://www.adminer.org    
https://razorsql.com
https://sqlitebrowser.org    
https://towardsdatascience.com/10-best-sql-editor-tools-in-the-market-126acd64ba06    
https://learnsql.com/blog/best-sql-editor/     


#### sqlite3
The sqlite3 module in the Python standard library provides a SQL interface to communicate with databases.<br>
https://docs.python.org/3/library/sqlite3.html

Once you have a `Connection`, you can create a `Cursor` object and call its execute() method to perform SQL commands.

`Cursor` objects represent a database cursor, which is used to manage the context of a fetch/retrieval operation.  
A call to the `Cursor`'s execute() method is used to perform SQL commands.

#### SQLite uses a greatly simplified set of data types:
* INTEGER - numeric
* REAL - numeric
* TEXT – text of any length
    * Dates are held as text
* BLOB – binary large objects
    * Such as images

#### The data

https://datacarpentry.org/python-ecology-lesson/

Download the database file `portal_mammals.sqlite` from:   
https://datacarpentry.org/python-ecology-lesson/setup.html      
"     
The data we will be using is a time-series for a small mammal community in southern Arizona.    
This is part of a project studying the effects of rodents and ants on the plant community that has been running for almost 40 years.    
The rodents are sampled on a series of 24 plots, with different experimental manipulations controlling which rodents are allowed to access which plots.    
"   
https://datacarpentry.org/sql-ecology-lesson/00-sql-introduction/index.html

In [5]:
# bring into the environment the  functionality that 
# can be used to connect to a database

from sqlite3 import connect

'''    
    Establish a connection to the database.
    This statement creates the file at the given path if it does not exist and that will be an empty database.
    The file was provided in this case so the statement should just establish the connection.
'''

# create a connection object to be able to acceess the database

connection = connect('portal_mammals.sqlite')

# create a cursor to interact with the database and 
# send commands to the database 

cursor = connection.cursor()

#### The cursor and the connection should be closed when we no loger run queries.
```python
cursor.close()
connection.close()
```

We are still using them so we keep them open for now.     
After we close them, we should run the above cell again to reestablish the access to the database.

In [7]:
# what is the type of the connection object?

type(connection)

sqlite3.Connection

In [47]:
# what can the connection object do? 
# look at only for non __ methods and attributes

[elem for elem in dir(connection) if not elem.startswith("__")]

['DataError',
 'DatabaseError',
 'Error',
 'IntegrityError',
 'InterfaceError',
 'InternalError',
 'NotSupportedError',
 'OperationalError',
 'ProgrammingError',
 'Warning',
 'autocommit',
 'backup',
 'blobopen',
 'close',
 'commit',
 'create_aggregate',
 'create_collation',
 'create_function',
 'create_window_function',
 'cursor',
 'deserialize',
 'enable_load_extension',
 'execute',
 'executemany',
 'executescript',
 'getconfig',
 'getlimit',
 'in_transaction',
 'interrupt',
 'isolation_level',
 'iterdump',
 'load_extension',
 'rollback',
 'row_factory',
 'serialize',
 'set_authorizer',
 'set_progress_handler',
 'set_trace_callback',
 'setconfig',
 'setlimit',
 'text_factory',
 'total_changes']

In [9]:
# what is the type of the cursor object?
type(cursor)

sqlite3.Cursor

In [51]:
# what can the cursor object do? 
# look at only for non __ methods and attributes

[elem for elem in dir(cursor) if not elem.startswith("__")]

['arraysize',
 'close',
 'connection',
 'description',
 'execute',
 'executemany',
 'executescript',
 'fetchall',
 'fetchmany',
 'fetchone',
 'lastrowid',
 'row_factory',
 'rowcount',
 'setinputsizes',
 'setoutputsize']

____

#### Major SQL commands: SELECT, INSERT, DELETE, UPDATE

____ 

#### SELECT - Retrieves data from one or more tables and doesn’t change the data at all 

<img src = http://www.tutorialscan.com/wp-content/uploads/2018/04/sql_select.jpg width = 300 />

http://www.tutorialscan.com/wp-content/uploads/2018/04/sql_select.jpg

#### A more complex diagram with all the options is available at:
#### https://www.sqlite.org/syntaxdiagrams.html#select-stmt

#### Description of each of the options:
* **SELECT**  * (means all columns), or the comma separated names of the columns of data you wish to return
    * Returns columns (left to right) in the order received. 
    * '*' selects ALL rows and ALL columns and returns them by column order and row_id
* **FROM** is the table source or sources (comma separated)
* **WHERE** (optional)** is the predicate clause: conditions for the query
    * Evaluates to True or False for each row
    * This clause almost always includes Column-Value pairs.
    * Omitting the Where clause returns ALL the records in that table.
    * Note: the match is case sensitive
* **ORDER BY (optional)** indicates a sort order for the output data 
    * default is row_id, which can be very non-intuitive  
    * ASCending or DESCending can be appended to change the sort order.  (ASC is default)
* **GROUP BY (optional)** groups by a column and creates summary data for a different column
* **HAVING (optional)** allows restrictions on the rows selected
    * a GROUP BY clause is required before HAVING
* **LIMIT (optional)** reduces the number of rows retrieved to the number provided after this clause
* In most SQL clients, the ";" indicates the end of a statement and requests execution

In [11]:
# In every SQLite database, there is a special table: sqlite_master
# sqlite_master -  describes the contents of the database

# the SQL command can be ran as is when using a Integrated Development Environment 
# e.g. DBeaver

sql = '''
SELECT type, name 
FROM sqlite_master LIMIT 5;'''
cursor.execute(sql)

In [55]:
list(cursor)

[('table', 'surveys'),
 ('table', 'species'),
 ('table', 'plots'),
 ('table', 'sqlite_sequence'),
 ('table', 'test_table')]

In [15]:
sql = '''
SELECT type, name 
FROM sqlite_master;'''
cursor.execute(sql)
list(cursor)

[('table', 'surveys'),
 ('table', 'species'),
 ('table', 'plots'),
 ('table', 'sqlite_sequence'),
 ('table', 'test_table'),
 ('index', 'test_column1_idx'),
 ('view', 'survey_test')]

In [17]:
# look at the help of the fetchall method for the cursor 
help(cursor.fetchall)

Help on built-in function fetchall:

fetchall() method of sqlite3.Cursor instance
    Fetches all rows from the resultset.

In [21]:
sql = '''
SELECT * 
FROM sqlite_master;'''
cursor.execute(sql)
cursor.fetchall()

[('table',
  'surveys',
  'surveys',
  2,
  'CREATE TABLE surveys (\n\trecord_id BIGINT, \n\tmonth BIGINT, \n\tday BIGINT, \n\tyear BIGINT, \n\tplot_id BIGINT, \n\tspecies_id TEXT, \n\tsex TEXT, \n\thindfoot_length FLOAT, \n\tweight FLOAT\n)'),
 ('table',
  'species',
  'species',
  241,
  'CREATE TABLE species (\n\tspecies_id TEXT, \n\tgenus TEXT, \n\tspecies TEXT, \n\ttaxa TEXT\n)'),
 ('table',
  'plots',
  'plots',
  242,
  'CREATE TABLE plots (\n\tplot_id BIGINT, \n\tplot_type TEXT\n)'),
 ('table',
  'sqlite_sequence',
  'sqlite_sequence',
  244,
  'CREATE TABLE sqlite_sequence(name,seq)'),
 ('table',
  'test_table',
  'test_table',
  243,
  'CREATE TABLE test_table (column1 INTEGER, column2 TEXT)'),
 ('index',
  'test_column1_idx',
  'test_table',
  245,
  'CREATE INDEX test_column1_idx  ON test_table (column1)'),
 ('view',
  'survey_test',
  'survey_test',
  0,
  'CREATE VIEW survey_test (record_id, month, year, plotid, test1, test2) AS\nSELECT record_id, month, year, plot_id, column1, column2\nFROM surveys sv\n\tINNER JOIN test_table tt \n\tON sv.record_id = tt.column1 \nWHERE record_id < 10')]

In [23]:
cursor.description

(('type', None, None, None, None, None, None),
 ('name', None, None, None, None, None, None),
 ('tbl_name', None, None, None, None, None, None),
 ('rootpage', None, None, None, None, None, None),
 ('sql', None, None, None, None, None, None))

In [ ]:
sql = '''
SELECT name,type 
FROM sqlite_master;
'''
cursor.execute(sql)
cursor.fetchall()

In [25]:
sql = '''
SELECT name,type 
FROM sqlite_master;
'''
cursor.execute(sql)

# use a for loop to get the rows in the result one by one
for row in cursor: 
    print(row)

('surveys', 'table')
('species', 'table')
('plots', 'table')
('sqlite_sequence', 'table')
('test_table', 'table')
('test_column1_idx', 'index')
('survey_test', 'view')

In [29]:
sql = '''
SELECT name,type 
FROM sqlite_master;
'''
cursor.execute(sql)

# use fetchone retrieve just one row from the results
cursor.fetchone()

('surveys', 'table')

In [31]:
cursor.fetchone()

('species', 'table')

In [33]:
# See the result header

cursor.description

(('name', None, None, None, None, None, None),
 ('type', None, None, None, None, None, None))

In [41]:
data_header = [t[0] for t in cursor.description]
data_header

['name', 'type']

In [43]:
import pandas as pd

cursor.execute(sql)

df = pd.DataFrame(cursor)
df.columns = data_header
df

               name   type
0           surveys  table
1           species  table
2             plots  table
3   sqlite_sequence  table
4        test_table  table
5  test_column1_idx  index
6       survey_test   view

In [45]:
def get_header(cursor):
    '''
    Makes a tab delimited header row from the cursor description.
    Arguments:
        cursor: a cursor after a select query
    Returns:
        string: A string consisting of the column names separated by tabs, no new line
    '''
    return '\t'.join([row[0] for row in cursor.description])

In [47]:
get_header(cursor)

'name\ttype'

In [49]:
print(get_header(cursor))

name	type

#### Different ways to retrieve results - observe the different data structures displayed

In [53]:
# we already have the query in the sql variable

print(sql)

SELECT name,type
FROM sqlite_master;

In [55]:
# See the result

cursor.execute(sql)
print("Iterate through the cursor:")
for row in cursor: 
    print(row)
    
print()

cursor.execute(sql)
print("Use the Cursor fetchall() method:")
cursor.fetchall()

Iterate through the cursor:
('surveys', 'table')
('species', 'table')
('plots', 'table')
('sqlite_sequence', 'table')
('test_table', 'table')
('test_column1_idx', 'index')
('survey_test', 'view')

Use the Cursor fetchall() method:

[('surveys', 'table'),
 ('species', 'table'),
 ('plots', 'table'),
 ('sqlite_sequence', 'table'),
 ('test_table', 'table'),
 ('test_column1_idx', 'index'),
 ('survey_test', 'view')]

In [57]:
# note that if you have a large result 
# this function will try to make a very large string from it
# so it is recommended for results with less than 10 rows and 10 columns
# for other cases use the for loop to go through the rows in the result 

def get_results(cursor):
    '''
    Makes a tab delimited table from the cursor results.
    Arguments:
        cursor: a cursor after a select query
    Returns:
        string: A string consisting of the column names separated by tabs, no new line
    ''' 
    res = list()
    for row in cursor:        
        res.append('\t'.join(list(map(str,row))))
    return "\n".join(res)

In [59]:
# use the functions we created for a nice display of the results

cursor.execute(sql)

print(get_header(cursor))
print(get_results(cursor))

name	type
surveys	table
species	table
plots	table
sqlite_sequence	table
test_table	table
test_column1_idx	index
survey_test	view

##### WHERE clause example (-- denotes comment)

In [61]:
# more examples with comments later
# in the WHERE clause we put conditions to filter the data

sql = '''
SELECT name
FROM sqlite_master 
WHERE type = "table"; -- condition that allows the selection of specific rows
'''
cursor.execute(sql)
print(get_header(cursor))
print(get_results(cursor))

name
surveys
species
plots
sqlite_sequence
test_table

In [63]:
# Selects all columns (*) of the species table 
# retrieves only 10 rows due to the LIMIT clause
# The first column is the species id

sql = '''
SELECT *
FROM species LIMIT 20;
'''
cursor.execute(sql)
print(get_header(cursor))
print(get_results(cursor))

species_id	genus	species	taxa
AB	Amphispiza	bilineata	Bird
AH	Ammospermophilus	harrisi	Rodent
AS	Ammodramus	savannarum	Bird
BA	Baiomys	taylori	Rodent
CB	Campylorhynchus	brunneicapillus	Bird
CM	Calamospiza	melanocorys	Bird
CQ	Callipepla	squamata	Bird
CS	Crotalus	scutalatus	Reptile
CT	Cnemidophorus	tigris	Reptile
CU	Cnemidophorus	uniparens	Reptile
CV	Crotalus	viridis	Reptile
DM	Dipodomys	merriami	Rodent
DO	Dipodomys	ordii	Rodent
DS	Dipodomys	spectabilis	Rodent
DX	Dipodomys	sp.	Rodent
EO	Eumeces	obsoletus	Reptile
GS	Gambelia	silus	Reptile
NL	Neotoma	albigula	Rodent
NX	Neotoma	sp.	Rodent
OL	Onychomys	leucogaster	Rodent

##### Aliasing column names to make them easier to understand 
- add a new name for a column next to the column name using quotes if the alias contains spaces, the AS keyword can also be used
    - e.g.: column_name AS "Alias name"
    - e.g.: column_name "Alias name"
    - e.g.: column_name Alias_name

In [65]:
# example of aliasing columns

sql = '''
SELECT species_id ID, species as "Species Name"
FROM species LIMIT 5;
'''
cursor.execute(sql)
print(get_header(cursor))
print(get_results(cursor))

ID	Species Name
AB	bilineata
AH	harrisi
AS	savannarum
BA	taylori
CB	brunneicapillus

In [67]:
# we can use aggregate functions to summarize data
# COUNT returns a single number, which is the count of all rows in the table

sql = '''
SELECT count(*) FROM species;
'''
cursor.execute(sql)
print(get_header(cursor))
print(get_results(cursor))

count(*)
54

In [69]:
sql = '''
SELECT count(species_id) AS 'Number of species' 
FROM species;
'''|
cursor.execute(sql)
print(get_header(cursor))
print(get_results(cursor))

Number of species
54

In [71]:
# select first 50 rows from the surveys table - all columns
sql = """
SELECT  *
FROM surveys
LIMIT 50;
"""
cursor.execute(sql)
print(get_header(cursor))
print(get_results(cursor))

record_id	month	day	year	plot_id	species_id	sex	hindfoot_length	weight
1	7	16	1977	2	NL	M	32.0	None
2	7	16	1977	3	NL	M	33.0	None
3	7	16	1977	2	DM	F	37.0	None
4	7	16	1977	7	DM	M	36.0	None
5	7	16	1977	3	DM	M	35.0	None
6	7	16	1977	1	PF	M	14.0	None
7	7	16	1977	2	PE	F	None	None
8	7	16	1977	1	DM	M	37.0	None
9	7	16	1977	1	DM	F	34.0	None
10	7	16	1977	6	PF	F	20.0	None
11	7	16	1977	5	DS	F	53.0	None
12	7	16	1977	7	DM	M	38.0	None
13	7	16	1977	3	DM	M	35.0	None
14	7	16	1977	8	DM	None	None	None
15	7	16	1977	6	DM	F	36.0	None
16	7	16	1977	4	DM	F	36.0	None
17	7	16	1977	3	DS	F	48.0	None
18	7	16	1977	2	PP	M	22.0	None
19	7	16	1977	4	PF	None	None	None
20	7	17	1977	11	DS	F	48.0	None
21	7	17	1977	14	DM	F	34.0	None
22	7	17	1977	15	NL	F	31.0	None
23	7	17	1977	13	DM	M	36.0	None
24	7	17	1977	13	SH	M	21.0	None
25	7	17	1977	9	DM	M	35.0	None
26	7	17	1977	15	DM	M	31.0	None
27	7	17	1977	15	DM	M	36.0	None
28	7	17	1977	11	DM	M	38.0	None
29	7	17	1977	11	PP	M	None	None
30	7	17	1977	10	DS	F	52.0	None
31	7	17	1977	15	DM	F	37.0	None
32	7	17	1977	10	DM	F	35.0	None
33	7	17	1977	11	DM	F	36.0	None
34	7	17	1977	17	DM	None	None	None
35	7	17	1977	13	DM	F	38.0	None
36	7	17	1977	16	OT	F	22.0	None
37	7	17	1977	11	DM	F	35.0	None
38	7	17	1977	17	NL	M	33.0	None
39	7	17	1977	11	DM	F	36.0	None
40	7	18	1977	20	DM	M	36.0	None
41	7	18	1977	23	DM	F	34.0	None
42	7	18	1977	18	DS	F	46.0	None
43	7	18	1977	21	DM	M	36.0	None
44	7	18	1977	18	DM	F	35.0	None
45	7	18	1977	22	DM	M	36.0	None
46	7	18	1977	19	DM	M	35.0	None
47	7	18	1977	18	DM	M	32.0	None
48	7	18	1977	20	DM	F	36.0	None
49	7	18	1977	12	PP	F	17.0	None
50	7	18	1977	18	DM	F	32.0	None

In [73]:
sql = '''
SELECT * 
FROM surveys
LIMIT 20;
'''
cursor.execute(sql)
print(get_header(cursor))
print(get_results(cursor))

record_id	month	day	year	plot_id	species_id	sex	hindfoot_length	weight
1	7	16	1977	2	NL	M	32.0	None
2	7	16	1977	3	NL	M	33.0	None
3	7	16	1977	2	DM	F	37.0	None
4	7	16	1977	7	DM	M	36.0	None
5	7	16	1977	3	DM	M	35.0	None
6	7	16	1977	1	PF	M	14.0	None
7	7	16	1977	2	PE	F	None	None
8	7	16	1977	1	DM	M	37.0	None
9	7	16	1977	1	DM	F	34.0	None
10	7	16	1977	6	PF	F	20.0	None
11	7	16	1977	5	DS	F	53.0	None
12	7	16	1977	7	DM	M	38.0	None
13	7	16	1977	3	DM	M	35.0	None
14	7	16	1977	8	DM	None	None	None
15	7	16	1977	6	DM	F	36.0	None
16	7	16	1977	4	DM	F	36.0	None
17	7	16	1977	3	DS	F	48.0	None
18	7	16	1977	2	PP	M	22.0	None
19	7	16	1977	4	PF	None	None	None
20	7	17	1977	11	DS	F	48.0	None

In [81]:
# DISTINCT selects  non-duplicated elements (rows)

sql = '''
SELECT month, year FROM surveys LIMIT 5;
'''
cursor.execute(sql)
print(get_header(cursor))
print(get_results(cursor))

print()

sql = '''
SELECT DISTINCT month, year FROM surveys LIMIT 5;
'''
cursor.execute(sql)
print(get_header(cursor))
print(get_results(cursor))

month	year
7	1977
7	1977
7	1977
7	1977
7	1977

month	year
7	1977
8	1977
9	1977
10	1977
11	1977

In [87]:
sql = '''
SELECT DISTINCT year FROM surveys ;
'''
cursor.execute(sql)
print(get_header(cursor))
print(get_results(cursor))

year
1977
1978
1979
1980
1981
1982
1983
1984
1985
1986
1987
1988
1989
1990
1991
1992
1993
1994
1995
1996
1997
1998
1999
2000
2001
2002

In [89]:
# Other aggregate functions are available for numerical columns
# https://www.sqlite.org/lang_aggfunc.html
# comments are added using -- in front of the test to comment or using /* comment */ 

sql = '''
SELECT MAX(DISTINCT plot_id) MAX_PID 
FROM surveys; -- comment LIMIT 5; /* comment */
'''
cursor.execute(sql)
print(get_header(cursor))
print(get_results(cursor))

MAX_PID
24

In [91]:
sql = '''
SELECT MIN(DISTINCT plot_id) MIN_PID 
FROM surveys; 
'''
cursor.execute(sql)
print(get_header(cursor))
print(get_results(cursor))

MIN_PID
1

In [109]:
# count the number of rows in surveys
sql_survey_row_count = """
SELECT count(*) as survey_count
FROM surveys;
"""

cursor.execute(sql_survey_row_count)
data_header = [t[0] for t in cursor.description]
res_df = pd.DataFrame(cursor)
res_df.columns = data_header
res_df

   survey_count
0         35549

In [123]:
sql_survey_row_count = """
SELECT DISTINCT count(*) as survey_count
FROM surveys;
"""

cursor.execute(sql_survey_row_count)
data_header = [t[0] for t in cursor.description]
res_df = pd.DataFrame(cursor)
res_df.columns = data_header
res_df

   survey_count
0         35549

In [125]:
sql_survey_row_count = """
SELECT count(DISTINCT species_id) as species_count
FROM surveys;
"""

cursor.execute(sql_survey_row_count)
data_header = [t[0] for t in cursor.description]
res_df = pd.DataFrame(cursor)
res_df.columns = data_header
res_df

   survey_count
0            48

In [121]:
# count the number of distinct species in surveys

sql_survey_row_count = """
SELECT count(species_id) species_count
FROM 
    (SELECT DISTINCT species_id 
    FROM surveys);
"""

cursor.execute(sql_survey_row_count)
data_header = [t[0] for t in cursor.description]
res_df = pd.DataFrame(cursor)
res_df.columns = data_header
res_df

   species_count
0             48

#### WHERE clause operators
https://www.sqlite.org/lang_expr.html

<> ,  != 	inequality <br>
<			less than <br>
<= 			less than or equal <br>
=			equal <br>
'>			greater than <br>
'>= 		greater than or equal <br>
BETWEEN v1 AND v2	tests that a value to lies in a given range <br>
EXISTS		test for existence of rows matching query <br>
IN			tests if a value falls within a given set or query <br>
IS [ NOT ] NULL	is or is not null <br>
[ NOT ] LIKE		tests value to see if like or not like another <br>

% is the wildcard in SQL, used in conjunction with LIKE

........................................................................

Merriam's kangaroo rat (Dipodomys merriami - DM)

<img src = https://upload.wikimedia.org/wikipedia/commons/thumb/a/a4/Merriam%27s_Kangaroo_Rat.jpg/440px-Merriam%27s_Kangaroo_Rat.jpg width = 150 />

https://en.wikipedia.org/wiki/Merriam%27s_kangaroo_rat      
........................................................................

In [127]:
# we can put multiple conditions in the  where clause 
# combine conditions with AND, OR
# let's see the DM rats that have a weight < 40 and were seen on a specific plot in 1990

sql = '''
SELECT * FROM surveys 
WHERE plot_id = '11' AND species_id = "DM" AND weight < 40 AND year = 1990;
'''
cursor.execute(sql)
print(get_header(cursor))
print(get_results(cursor))

record_id	month	day	year	plot_id	species_id	sex	hindfoot_length	weight
17221	2	25	1990	11	DM	F	37.0	39.0
17550	5	24	1990	11	DM	F	34.0	23.0
17649	6	22	1990	11	DM	M	33.0	20.0
17730	7	22	1990	11	DM	F	36.0	33.0
17808	8	17	1990	11	DM	F	37.0	35.0
17816	8	17	1990	11	DM	F	35.0	23.0
17874	9	25	1990	11	DM	F	None	39.0
17943	10	16	1990	11	DM	F	37.0	39.0
18051	11	11	1990	11	DM	F	37.0	38.0
18156	12	16	1990	11	DM	F	34.0	37.0
18182	12	16	1990	11	DM	F	37.0	37.0

In [129]:
sql = '''
SELECT * FROM surveys 
WHERE species_id IN ("DS", "DM", "PF") AND
      plot_id IN (10, 11) AND
      year IN (1980, 1983) AND 
      month IN (1,3) AND
      sex = "M";
'''
cursor.execute(sql)
print(get_header(cursor))
print(get_results(cursor))

record_id	month	day	year	plot_id	species_id	sex	hindfoot_length	weight
2274	1	15	1980	11	DM	M	38.0	37.0
2276	1	15	1980	11	DS	M	47.0	132.0
2286	1	15	1980	11	DM	M	38.0	47.0
2290	1	15	1980	11	DM	M	37.0	49.0
2297	1	15	1980	11	DM	M	37.0	45.0
2310	1	15	1980	11	DM	M	36.0	48.0
2319	1	15	1980	11	DM	M	37.0	26.0
2324	1	15	1980	11	DM	M	35.0	49.0
2641	3	9	1980	11	DS	M	None	147.0
2648	3	9	1980	11	DM	M	None	42.0
7179	1	12	1983	11	DM	M	37.0	38.0
7186	1	12	1983	11	DM	M	36.0	43.0
7223	1	12	1983	11	DM	M	36.0	46.0
7492	3	14	1983	11	DM	M	34.0	42.0
7493	3	14	1983	11	DM	M	37.0	46.0
7498	3	14	1983	11	DM	M	36.0	45.0
7519	3	14	1983	11	PF	M	17.0	6.0
7525	3	14	1983	11	DM	M	37.0	52.0
7537	3	14	1983	11	DM	M	37.0	46.0

In [131]:
sql = '''
SELECT * FROM surveys 
WHERE species_id = 'DM' AND 
      weight BETWEEN 30 AND 40 AND
      plot_id BETWEEN 6 AND 8 AND
      year BETWEEN 1989 AND 1990;
'''
cursor.execute(sql)
print(get_header(cursor))
print(get_results(cursor))

record_id	month	day	year	plot_id	species_id	sex	hindfoot_length	weight
15469	1	11	1989	8	DM	M	36.0	39.0
16161	6	4	1989	8	DM	M	36.0	34.0
16201	6	4	1989	8	DM	F	50.0	38.0
16306	7	4	1989	8	DM	F	None	32.0
16414	7	30	1989	8	DM	F	36.0	36.0
16545	10	8	1989	6	DM	M	36.0	40.0
16673	11	5	1989	8	DM	F	35.0	39.0
16942	1	7	1990	8	DM	F	36.0	38.0
17055	1	30	1990	8	DM	F	37.0	39.0
17079	1	30	1990	8	DM	F	35.0	35.0
17114	1	30	1990	8	DM	F	37.0	36.0
17197	2	25	1990	8	DM	F	36.0	38.0
17229	2	25	1990	8	DM	F	35.0	40.0
17369	3	30	1990	8	DM	F	36.0	39.0
17441	4	26	1990	8	DM	F	37.0	39.0
17442	4	26	1990	8	DM	F	37.0	40.0
17516	5	24	1990	8	DM	M	36.0	32.0
17529	5	24	1990	8	DM	M	35.0	30.0
17610	6	22	1990	8	DM	M	36.0	37.0
17851	9	25	1990	8	DM	F	None	39.0
17937	10	16	1990	8	DM	F	35.0	40.0
18026	11	11	1990	8	DM	F	36.0	35.0
18029	11	11	1990	8	DM	M	37.0	40.0
18040	11	11	1990	8	DM	M	36.0	35.0
18063	11	11	1990	8	DM	M	36.0	38.0
18065	11	11	1990	8	DM	F	36.0	40.0
18129	12	16	1990	8	DM	F	36.0	40.0
18153	12	16	1990	8	DM	M	37.0	36.0
18168	12	16	1990	8	DM	F	35.0	38.0
18174	12	16	1990	8	DM	M	37.0	39.0

In [133]:
# LIKE allows you to look for patterns

sql = '''
SELECT * 
FROM species 
WHERE genus LIKE '%per%'; -- not case sensitive
'''
cursor.execute(sql)
print(get_header(cursor))
print(get_results(cursor))

species_id	genus	species	taxa
AH	Ammospermophilus	harrisi	Rodent
PE	Peromyscus	eremicus	Rodent
PF	Perognathus	flavus	Rodent
PH	Perognathus	hispidus	Rodent
PL	Peromyscus	leucopus	Rodent
PM	Peromyscus	maniculatus	Rodent
SS	Spermophilus	spilosoma	Rodent
ST	Spermophilus	tereticaudus	Rodent

In [137]:
# Retrieve rows from surveys where the species_id is DM 
# and has been seen in 1990 or 1995 in June-August on plot 1

sql_select_surveys = """
SELECT *
FROM surveys
WHERE 
    plot_id = 1 AND
    species_id = "DM" AND
    year IN (1990, 1995) AND
    month BETWEEN 6 AND 8;
    
"""
cursor.execute(sql_select_surveys)
data_header = [t[0] for t in cursor.description]
res_df = pd.DataFrame(cursor)
res_df.columns = data_header
res_df

,record_id,month,day,year,plot_id,species_id,sex,hindfoot_length,weight
0,17604,6,21,1990,1,DM,M,36.0,43.0
1,17656,7,21,1990,1,DM,M,35.0,43.0
2,17664,7,21,1990,1,DM,M,38.0,45.0
3,17666,7,21,1990,1,DM,M,37.0,46.0
4,17742,8,16,1990,1,DM,F,36.0,43.0
5,17748,8,16,1990,1,DM,M,37.0,45.0
6,17767,8,16,1990,1,DM,M,37.0,41.0
7,22301,6,7,1995,1,DM,F,38.0,50.0
8,22363,6,27,1995,1,DM,M,38.0,48.0
9,22435,7,20,1995,1,DM,F,35.0,35.0
10,22554,8,26,1995,1,DM,F,36.0,42.0

In [135]:
# ORDER BY (optional) - indicates a sort order given by a column in the the output data and the sort order: ASC or DESC

sql = '''
SELECT *
FROM surveys 
WHERE month = 6 AND year = 1983 AND sex = "F" AND plot_id BETWEEN 10 AND 20
ORDER BY plot_id  ASC, species_id DESC
--LIMIT 20;
'''
cursor.execute(sql)
print(get_header(cursor))
print(get_results(cursor))

record_id	month	day	year	plot_id	species_id	sex	hindfoot_length	weight
8016	6	18	1983	11	OT	F	20.0	30.0
8046	6	18	1983	11	DS	F	52.0	128.0
8010	6	18	1983	11	DO	F	36.0	46.0
7938	6	17	1983	12	PP	F	22.0	20.0
7970	6	17	1983	12	OT	F	20.0	15.0
7936	6	17	1983	12	DO	F	34.0	42.0
7962	6	17	1983	12	DO	F	33.0	39.0
7957	6	17	1983	12	DM	F	36.0	44.0
7980	6	17	1983	12	DM	F	31.0	16.0
7981	6	17	1983	13	DM	F	34.0	49.0
7989	6	17	1983	13	DM	F	35.0	46.0
7953	6	17	1983	14	DO	F	31.0	19.0
7972	6	17	1983	14	DO	F	33.0	15.0
7976	6	17	1983	14	DO	F	33.0	46.0
8031	6	18	1983	15	OL	F	20.0	45.0
8033	6	18	1983	15	NL	F	29.0	117.0
7934	6	17	1983	17	DM	F	33.0	38.0
7968	6	17	1983	18	OT	F	20.0	22.0
7959	6	17	1983	18	NL	F	32.0	162.0
7977	6	17	1983	18	DS	F	47.0	64.0
7983	6	17	1983	19	RM	F	16.0	15.0
7986	6	17	1983	19	PF	F	16.0	7.0
7937	6	17	1983	20	NL	F	31.0	None
7967	6	17	1983	20	NL	F	32.0	150.0
7939	6	17	1983	20	DS	F	50.0	111.0
7947	6	17	1983	20	DO	F	35.0	41.0
7971	6	17	1983	20	DM	F	36.0	None

The PRAGMA statement is an SQL extension specific to SQLite and used to modify the operation of the SQLite library or to query the SQLite library for internal (non-table) data.
https://www.sqlite.org/pragma.html

____
Sqlite3 also has some PRAGMA methods <br>
This is an SQL extension specific to SQLite that is used to modify the operation of the SQLite library or to query the SQLite library for internal (non-table) data <br>
https://www.sqlite.org/pragma.html <br>
The code below shows how to get the schema (columns and columns information)

In [139]:
# get the information about the data table
# other PRAGMA methods can provide other types of information

sql = 'PRAGMA table_info("species")'
cursor.execute(sql)
print(get_header(cursor))
print(get_results(cursor))

cid	name	type	notnull	dflt_value	pk
0	species_id	TEXT	0	None	0
1	genus	TEXT	0	None	0
2	species	TEXT	0	None	0
3	taxa	TEXT	0	None	0

In [143]:
sql = '''SELECT * FROM pragma_table_info("species")  '''
cursor.execute(sql)
print(get_header(cursor))
print(get_results(cursor))

cid	name	type	notnull	dflt_value	pk
0	species_id	TEXT	0	None	0
1	genus	TEXT	0	None	0
2	species	TEXT	0	None	0
3	taxa	TEXT	0	None	0

In [145]:
sql = '''SELECT * FROM pragma_table_info("surveys")  '''
cursor.execute(sql)
print(get_header(cursor))
print(get_results(cursor))

cid	name	type	notnull	dflt_value	pk
0	record_id	BIGINT	0	None	0
1	month	BIGINT	0	None	0
2	day	BIGINT	0	None	0
3	year	BIGINT	0	None	0
4	plot_id	BIGINT	0	None	0
5	species_id	TEXT	0	None	0
6	sex	TEXT	0	None	0
7	hindfoot_length	FLOAT	0	None	0
8	weight	FLOAT	0	None	0

___

In [10]:
from sqlite3 import connect
import pandas as pd
connection = connect("portal_mammals.sqlite")
cursor = connection.cursor()

In [16]:
def run_query(cursor, sql):
    
    cursor.execute(sql)
    header = [t[0] for t in cursor.description]
    df = pd.DataFrame(cursor.fetchall(), columns = header)
    return df

In [20]:
# SUB-QUERY - we can have a query in a query

sql = '''
SELECT *
FROM species
WHERE species_id IN
    (SELECT DISTINCT species_id 
    FROM surveys
    WHERE year = 1997 AND month = 4); 
'''
df = run_query(cursor, sql)
df

   species_id            genus       species    taxa
0          DM        Dipodomys      merriami  Rodent
1          DO        Dipodomys         ordii  Rodent
2          OL        Onychomys   leucogaster  Rodent
3          OT        Onychomys      torridus  Rodent
4          PB      Chaetodipus       baileyi  Rodent
5          PE       Peromyscus      eremicus  Rodent
6          PF      Perognathus        flavus  Rodent
7          PM       Peromyscus   maniculatus  Rodent
8          PP      Chaetodipus  penicillatus  Rodent
9          RF  Reithrodontomys    fulvescens  Rodent
10         RM  Reithrodontomys     megalotis  Rodent

In [22]:
sql = '''
SELECT DISTINCT species_id 
    FROM surveys
    WHERE year = 1997 AND month = 4; 
'''
df = run_query(cursor, sql)
df

   species_id
0          DM
1          PP
2          RM
3          PF
4          PM
5          OT
6          PB
7          PE
8          DO
9          OL
10         RF

In [151]:
# GROUP BY groups by a column and creates summary data for a different column
# count entries for each GO term

sql = '''
SELECT species_id ID, count(*) AS record_no
FROM surveys 
GROUP BY species_id 
ORDER BY record_no DESC;
'''
cursor.execute(sql)
print(get_header(cursor))
print(get_results(cursor))

ID	record_no
DM	10596
PP	3123
DO	3027
PB	2891
RM	2609
DS	2504
OT	2249
PF	1597
PE	1299
NL	1252
OL	1006
PM	899
None	763
AH	437
AB	303
SS	248
SH	147
SA	75
RF	75
CB	50
BA	46
SO	43
SF	43
DX	40
PC	39
PL	36
PH	32
CQ	16
CM	13
OX	12
UR	10
PI	9
UP	8
RO	8
PG	8
PX	6
SU	5
PU	5
US	4
UL	4
ZL	2
RX	2
AS	2
ST	1
SC	1
CV	1
CU	1
CT	1
CS	1

In [155]:
sql = '''
SELECT species_id ID, month, count(*) AS record_no
FROM surveys 
WHERE year = 1990
GROUP BY species_id, month
ORDER BY record_no DESC;
'''
cursor.execute(sql)
print(get_header(cursor))
print(get_results(cursor))

ID	month	record_no
DM	1	60
RM	1	54
DM	12	47
DM	11	42
DM	10	41
DM	3	37
DM	4	37
DM	7	37
DM	2	35
DM	5	35
DM	8	33
DM	6	31
DO	1	31
RM	2	31
RM	3	30
RM	12	30
DM	9	27
AB	1	24
RM	4	23
RM	11	22
DO	2	17
DO	3	17
DO	4	15
DO	6	14
DO	8	14
PE	3	14
PE	1	13
DO	5	12
DO	12	12
DO	7	11
RM	5	11
RM	6	11
DO	11	10
OT	1	10
PE	2	10
RM	10	10
DO	9	9
DO	10	9
OT	11	9
OT	10	8
OT	12	8
PE	4	8
PE	12	8
PF	1	8
PP	9	8
SF	1	8
AH	5	7
OL	12	7
OT	7	7
OT	8	7
PC	2	7
PP	8	7
None	7	6
OT	2	6
OT	3	6
PF	3	6
PP	7	6
RF	1	6
NL	2	5
OT	4	5
OT	5	5
PE	9	5
PF	2	5
PF	6	5
PF	8	5
PF	12	5
RM	7	5
None	8	4
NL	9	4
OL	1	4
OT	6	4
PE	5	4
PE	11	4
PF	4	4
PF	10	4
PG	1	4
PP	4	4
AH	1	3
AH	9	3
DS	1	3
NL	3	3
NL	5	3
NL	10	3
OL	4	3
PE	10	3
PF	5	3
PF	11	3
PP	6	3
PP	10	3
RF	3	3
RM	8	3
SF	2	3
SH	3	3
SS	4	3
None	4	2
None	5	2
AH	4	2
AH	8	2
AH	10	2
AH	11	2
BA	2	2
BA	4	2
BA	12	2
DS	3	2
DS	6	2
DS	8	2
NL	1	2
NL	4	2
NL	11	2
NL	12	2
OL	2	2
OL	7	2
OL	9	2
OL	10	2
OT	9	2
PE	6	2
PE	7	2
PE	8	2
PF	7	2
PH	7	2
PP	5	2
RF	4	2
SF	3	2
SF	4	2
SF	5	2
SH	1	2
SH	2	2
None	1	1
AB	3	1
AB	9	1
AB	11	1
AH	2	1
BA	1	1
BA	5	1
BA	6	1
BA	8	1
BA	10	1
DS	2	1
DS	4	1
DS	5	1
DS	7	1
DS	9	1
DS	10	1
DS	11	1
DS	12	1
NL	6	1
NL	7	1
NL	8	1
OL	3	1
OL	8	1
OL	11	1
PC	4	1
PF	9	1
PH	1	1
PH	2	1
PH	3	1
PH	4	1
PH	5	1
PP	1	1
RF	2	1
RM	9	1
SF	6	1
SH	4	1
SH	5	1
SS	5	1
SS	9	1
UP	7	1

In [159]:
# specify column in aggregate function and alias the name of the columns

sql = '''
SELECT plot_id as "Plot No", count(record_id) as "Record Number" 
FROM surveys 
GROUP BY plot_id
ORDER BY count(record_id) DESC;
'''
cursor.execute(sql)
print(get_header(cursor))
print(get_results(cursor))

Plot No	Record Number
12	2365
2	2194
17	2039
1	1995
4	1969
9	1936
11	1918
8	1891
14	1885
3	1828
6	1582
13	1538
18	1445
22	1399
20	1390
5	1194
19	1189
21	1173
15	1069
24	1048
7	816
16	646
23	571
10	469

In [24]:
# HAVING allows restrictions on the rows used or selected
# a GROUP BY clause is required before HAVING

sql = '''
SELECT plot_id as "Plot No", count(record_id) counts 
FROM surveys 
GROUP BY plot_id
HAVING counts < 1000;
'''
cursor.execute(sql)
df = run_query(cursor,sql)
df

   Plot No  counts
0        7     816
1       10     469
2       16     646
3       23     571

In [169]:
# Select month, year combinations with more than 300 records

sql = '''
SELECT  month, year, count(*) AS record_no
FROM surveys 
GROUP BY month, year
HAVING record_no > 300
ORDER BY record_no DESC;
'''
cursor.execute(sql)
print(get_header(cursor))
print(get_results(cursor))

month	year	record_no
7	1997	542
12	2002	361
4	1981	342
10	1982	306

#### A `PRIMARY KEY` is a very important concept to understand.  
* It is the designation for a column or a set of columns from a table.
* It is recommended to be a serial value and not something related to the business needs of the data in the table.

* A primary key is used to uniquely identify a row of data; combined with a column name, uniquely locates a data entry
* A primary key by definition must be `UNIQUE` and `NOT NULL` 
* The primary key of a table, should be a (sequential) non-repeating and not null value  
* Primary keys are generally identified at time of table creation  
* A common method for generating a primary key, is to set the datatype to `INTEGER` and declare `AUTOINCREMENT` which will function when data is inserted into the table
* Primary keys can be a composite of 2 or more columns that uniquely identify the data in the table

#### A `FOREIGN KEY` is a column(s) that points to the `PRIMARY KEY` of another table 

* The purpose of the foreign key is to ensure referential integrity of the data. 
In other words, only values that are supposed to appear in the database are permitted.<br>
Only the values that exist in the `PRIMARY KEY` column are allowed to be present in the FOREIGN KEY column.
Example: A `gene` table has the `PRIMARY KEY` `gene_id`. The GO2_gene GO term is associated with a gene

They are also the underpinning of how tables are joined and relationships portrayed in the database

#### JOIN tables

* Multiple tables contain different data that we want to retrieve from a single query
* In order to assemble data as part of a query, a JOIN between tables is needed
* This is a very common practice, since it’s rare for all the data you want to be in a single table


* INNER JOIN - return only those rows where there is matching content in BOTH tables (is the default when JOIN is used)
* OUTER JOIN - returns all rows from both tables even if one of the tables is blank
* SELF JOIN - can be used to join a table to itself (through aliasing), to compare data internal to the table

```sql
SELECT ... FROM table1 [INNER] JOIN table2 ON conditional_expression
```

In [26]:
sql = """
SELECT * 
FROM surveys, species

"""

# this will return all combinations of rows between the two tables

In [28]:
sql = '''
SELECT *
FROM surveys AS sv
INNER JOIN species AS sp
      ON sv.species_id = sp.species_id
WHERE plot_id = "6" AND 
      year = 2001 AND 
      sex = "F" AND 
      genus LIKE "%on%";
'''
cursor.execute(sql)
df = run_query(cursor, sql)
df

,record_id,month,day,year,plot_id,species_id,sex,hindfoot_length,weight,species_id,genus,species,taxa
0,31762,1,22,2001,6,OT,F,20.0,26.0,OT,Onychomys,torridus,Rodent
1,32002,4,22,2001,6,SH,F,29.0,132.0,SH,Sigmodon,hispidus,Rodent
2,32099,5,27,2001,6,SH,F,30.0,86.0,SH,Sigmodon,hispidus,Rodent
3,32101,5,27,2001,6,SH,F,29.0,123.0,SH,Sigmodon,hispidus,Rodent
4,32104,5,27,2001,6,OT,F,20.0,34.0,OT,Onychomys,torridus,Rodent
5,32106,5,27,2001,6,OT,F,20.0,14.0,OT,Onychomys,torridus,Rodent
6,32940,10,14,2001,6,OT,F,20.0,27.0,OT,Onychomys,torridus,Rodent
7,33154,11,18,2001,6,OT,F,20.0,27.0,OT,Onychomys,torridus,Rodent

In [32]:
sql = '''
SELECT *
FROM surveys AS sv
    INNER JOIN species AS sp
        ON sv.species_id = sp.species_id
    INNER JOIN plots
        ON plots.plot_id = sv.plot_id

WHERE plots.plot_id IN (6,7) AND 
      year = 2001 AND 
      sex = "F" AND 
      genus LIKE "%on%";
'''
cursor.execute(sql)
df = run_query(cursor, sql)
df

,record_id,month,day,year,plot_id,species_id,sex,hindfoot_length,weight,species_id,genus,species,taxa,plot_id,plot_type
0,31762,1,22,2001,6,OT,F,20.0,26.0,OT,Onychomys,torridus,Rodent,6,Short-term Krat Exclosure
1,31988,4,21,2001,7,OT,F,21.0,27.0,OT,Onychomys,torridus,Rodent,7,Rodent Exclosure
2,32002,4,22,2001,6,SH,F,29.0,132.0,SH,Sigmodon,hispidus,Rodent,6,Short-term Krat Exclosure
3,32099,5,27,2001,6,SH,F,30.0,86.0,SH,Sigmodon,hispidus,Rodent,6,Short-term Krat Exclosure
4,32101,5,27,2001,6,SH,F,29.0,123.0,SH,Sigmodon,hispidus,Rodent,6,Short-term Krat Exclosure
5,32104,5,27,2001,6,OT,F,20.0,34.0,OT,Onychomys,torridus,Rodent,6,Short-term Krat Exclosure
6,32106,5,27,2001,6,OT,F,20.0,14.0,OT,Onychomys,torridus,Rodent,6,Short-term Krat Exclosure
7,32940,10,14,2001,6,OT,F,20.0,27.0,OT,Onychomys,torridus,Rodent,6,Short-term Krat Exclosure
8,33154,11,18,2001,6,OT,F,20.0,27.0,OT,Onychomys,torridus,Rodent,6,Short-term Krat Exclosure

#### See the create table statement

In [40]:
# sql column in the sqlite_master table

sql = '''
SELECT sql
FROM sqlite_master 
WHERE type = "table" and name == "species"
LIMIT 2;
'''
cursor.execute(sql)
df = run_query(cursor, sql)
print(df.iloc[0,0])

CREATE TABLE species (
	species_id TEXT,
	genus TEXT,
	species TEXT,
	taxa TEXT
)

___

### CREATE TABLE  - statement
##### <font color="red"> This statement makes changes to the database</font>


https://www.sqlitetutorial.net/sqlite-create-table/

```sql
CREATE TABLE [IF NOT EXISTS] [schema_name].table_name (
    column_1 data_type PRIMARY KEY,
    column_2 data_type NOT NULL,
    column_3 data_type DEFAULT 0,
    table_constraints
) [WITHOUT ROWID];
```

In this syntax:

* First, specify the name of the table that you want to create after the CREATE TABLE keywords. The name of the table cannot start with sqlite_ because it is reserved for the internal use of SQLite.
* Second, use `IF NOT EXISTS` option to create a new table if it does not exist. Attempting to create a table that already exists without using the IF NOT EXISTS option will result in an error.
* Third, optionally specify the schema_name to which the new table belongs. The schema can be the main database, temp database or any attached database.
* Fourth, specify the column list of the table. Each column has a name, data type, and the column constraint. SQLite supports `PRIMARY KEY, UNIQUE, NOT NULL`, and `CHECK` column constraints.
* Fifth, specify the table constraints such as PRIMARY KEY, FOREIGN KEY, UNIQUE, and CHECK constraints.
* Finally, optionally use the `WITHOUT ROWID` option. By default, a row in a table has an implicit column, which is referred to as the rowid, oid or _rowid_ column. The rowid column stores a 64-bit signed integer key that uniquely identifies the row inside the table. If you don’t want SQLite creates the rowid column, you specify the WITHOUT ROWID option. A table that contains the rowid column is known as a rowid table. Note that the WITHOUT ROWID option is only available in SQLite 3.8.2 or later.

https://www.sqlite.org/syntaxdiagrams.html#create-table-stmt

<img src = "https://www.sqlite.org/images/syntax/create-table-stmt.gif" width="800"/>

Each value stored in an SQLite database (or manipulated by the database engine) has one of the following storage classes:
https://www.sqlite.org/datatype3.html
* `NULL`. The value is a NULL value.
* `INTEGER`. The value is a signed integer, stored in 1, 2, 3, 4, 6, or 8 bytes depending on the magnitude of the value.
* `REAL`. The value is a floating point value, stored as an 8-byte IEEE floating point number.
* `TEXT`. The value is a text string, stored using the database encoding (UTF-8, UTF-16BE or UTF-16LE).
* `BLOB`. The value is a blob of data, stored exactly as it was input.

#### A `PRIMARY KEY` is a very important concept to understand.  
* It is the designation for a column or a set of columns from a table.
* It is recommended to be a serial value and not something related to the business needs of the data in the table.

* A primary key is used to uniquely identify a row of data; combined with a column name, uniquely locates a data entry
* A primary key by definition must be `UNIQUE` and `NOT NULL` 
* The primary key of a table, should be a (sequential) non-repeating and not null value  
* Primary keys are generally identified at time of table creation  
* A common method for generating a primary key, is to set the datatype to `INTEGER` and declare `AUTOINCREMENT` which will function when data is inserted into the table
* Primary keys can be a composite of 2 or more columns that uniquely identify the data in the table

#### A `FOREIGN KEY` is a column(s) that points to the `PRIMARY KEY` of another table 

* The purpose of the foreign key is to ensure referential integrity of the data. 
In other words, only values that are supposed to appear in the database are permitted.<br>
Only the values that exist in the `PRIMARY KEY` column are allowed to be present in the FOREIGN KEY column.
Example: A `gene` table has the `PRIMARY KEY` `gene_id`. The GO2_gene GO term is associated with a gene

They are also the underpinning of how tables are joined and relationships portrayed in the database

The `sqlite_master` has the following create statement: 
```sql
CREATE TABLE sqlite_master ( type TEXT, name TEXT, tbl_name TEXT, rootpage INTEGER, sql TEXT );
```

##### The `connection` object methods can be used to save or revert/reset the changes after a command that makes changes to the database
##### `COMMIT` - save the changes 
##### `ROLLBACK` - revert the changes

In [42]:
# select the sql statement for the survey table

sql = '''
SELECT sql
FROM sqlite_master 
WHERE name = "surveys";
'''
cursor.execute(sql)

# fetchall returns a list of tuples, 
# we want the first element in the list 
# and then the first element in the tuple

print(cursor.fetchall()[0][0])

CREATE TABLE surveys (
	record_id BIGINT,
	month BIGINT,
	day BIGINT,
	year BIGINT,
	plot_id BIGINT,
	species_id TEXT,
	sex TEXT,
	hindfoot_length FLOAT,
	weight FLOAT
)

#### We create the table `survey_summary` with the columns: `id`, `species_id`, `year`, and `count`

In [46]:
sql = "SELECT name FROM sqlite_master;"
cursor.execute(sql)
cursor.fetchall()

[('surveys',),
 ('species',),
 ('plots',),
 ('sqlite_sequence',),
 ('test_table',),
 ('test_column1_idx',),
 ('survey_test',)]

In [48]:
# Write and run a create table statement for the survey_summary table

sql='''
CREATE TABLE IF NOT EXISTS survey_summary (
      id INTEGER PRIMARY KEY AUTOINCREMENT,
      species_id TEXT NOT NULL,                     -- REFERENCES  species_id in species table
      year BIGINT NOT NULL,                      -- GO ID
      count BIGINT NOT NULL,                   -- GO evidence information
      FOREIGN KEY (species_id) REFERENCES  species  (species_id)
    );
'''
try:
    cursor.execute(sql)
except connection.DatabaseError:
    print("Creating the survey_summary table resulted in a database error!")
    connection.rollback()
    raise
else:
    connection.commit()
finally:
    print("done!")

done!

In [52]:
sql = "SELECT name FROM sqlite_master;"
cursor.execute(sql)
cursor.fetchall()

[('surveys',),
 ('species',),
 ('plots',),
 ('sqlite_sequence',),
 ('test_table',),
 ('test_column1_idx',),
 ('survey_test',),
 ('survey_summary',)]

In [56]:
sql = "SELECT * FROM survey_summary;"
cursor.execute(sql)
cursor.fetchall()

[]

In [62]:
sql = "PRAGMA table_info(survey_summary);"
cursor.execute(sql)
cursor.fetchall()

[(0, 'id', 'INTEGER', 0, None, 1),
 (1, 'species_id', 'TEXT', 1, None, 0),
 (2, 'year', 'BIGINT', 1, None, 0),
 (3, 'count', 'BIGINT', 1, None, 0)]

##### Similar error handling, as seen above, can be when executing any statement that changes the database.

##### Check if the new table appears in the `sqlite_master` table

In [64]:
sql = '''
SELECT name
FROM sqlite_master 
WHERE name LIKE "su%"
LIMIT 4;
'''
cursor.execute(sql)
print(cursor.fetchall())

[('surveys',), ('survey_test',), ('survey_summary',)]

  
<br><br> 
The `sqlite_sequence` table is created and initialized automatically whenever a regular table is created if it has a column with the `AUTOINCREMENT` option set.<br>
https://www.sqlite.org/autoinc.html

##### Check if the new table appears in the `sqlite_master` table

In [66]:
sql = '''
SELECT name
FROM sqlite_master;
'''
cursor.execute(sql)
print(cursor.fetchall())

[('surveys',), ('species',), ('plots',), ('sqlite_sequence',), ('test_table',), ('test_column1_idx',), ('survey_test',), ('survey_summary',)]

In [68]:
# the sqlite_sequence records keep track of the autoincrement column form different tables
# by storing the value where the autoincrement is currently
# if there was no data added in the table, no record exists in the sqlite_sequence table

sql = '''
SELECT *
FROM sqlite_sequence;
'''
cursor.execute(sql)
print(cursor.fetchall())

[]

____
### INDEXING

Indexes are lookup table, like the index of a book.
They are usually created for columns that have unique/ or less redundant values and provide a way to quicky search 
the values.<br>
Indexing creates a copy of the indexed columns together with a link to the location of the additional information.<br> 
The index data is stored in a data structure that allows for fast sorting. <br>
E.g.: balanced-tree - every leaf is at most n nodes away from the root) that allows for fast sorting. <br>
All queries (statements) regarding an indexed table are applied to the index


* One important function in Relational Databases is to be able to create indexes on columns in tables  
* These indexes are pre-calculated and stored in the database 
* Indexes should be created on columns that are used in queries and joins   
* They will rapidly speed up query return rate and improve query performance

To create an index use the following command:

```sql
CREATE INDEX indexName ON tableName (columnName)
```

In [70]:
sql = '''
CREATE INDEX survey_summary_idx 
ON survey_summary (species_id)
'''
cursor.execute(sql)
connection.commit()

##### Check if the new index appears in the `sqlite_master` table

In [72]:
sql = '''
SELECT name, sql
FROM sqlite_master 
WHERE type= "index";
'''
cursor.execute(sql)
cursor.fetchall()

[('test_column1_idx',
  'CREATE INDEX test_column1_idx  ON test_table (column1)'),
 ('survey_summary_idx',
  'CREATE INDEX survey_summary_idx \nON survey_summary (species_id)\n')]

#### Remove the index

In [74]:
sql = '''
DROP INDEX survey_summary_idx 
'''
cursor.execute(sql)
connection.commit()

##### Check if the index was removed from the `sqlite_master` table

In [76]:
sql = '''
SELECT name, sql
FROM sqlite_master 
WHERE type= "index";
'''
cursor.execute(sql)
cursor.fetchall()

[('test_column1_idx',
  'CREATE INDEX test_column1_idx  ON test_table (column1)')]

____ 

### INSERT - statement

##### <font color="red"> This statement makes changes to the database</font>
Adds new data to a table (if the constraints are met)    
Constraint examples: 
* For one designated column or a group of columns that are designated as Primary Key the values are unique
* The value inserted in a column that has a Foreign Key constraint should exist in the column that it refers to

```sql
INSERT INTO <tablename> (<column1>, <column2>, <column3>) VALUES (value1, value2, value3);
```

##### One simple INSERT command adds 1 row of data at a time into an existing table  

##### Connection object allows us to:
* ##### COMMIT - save the changes 
* ##### ROLLBACK - reverts/discards the changes

<br>

##### Let's see what is in the table (it should be nothing):

In [78]:
sql = '''
SELECT *
FROM survey_summary;
'''
cursor.execute(sql)
cursor.fetchall()

[]

In [80]:
sql = "PRAGMA table_info(survey_summary);"
cursor.execute(sql)
cursor.fetchall()

[(0, 'id', 'INTEGER', 0, None, 1),
 (1, 'species_id', 'TEXT', 1, None, 0),
 (2, 'year', 'BIGINT', 1, None, 0),
 (3, 'count', 'BIGINT', 1, None, 0)]

In [86]:
sql = "SELECT * FROM species WHERE species_id = ?"
cursor.execute(sql, ["DM"])
cursor.fetchall()

[('DM', 'Dipodomys', 'merriami', 'Rodent')]

<br>

##### Let's try an insert:
```sql
INSERT INTO <tablename> (<column1>, <column2>, <column3>) VALUES (value1, value2, value3);
```

In [88]:
values_list = ["DM",1960, 0]

sql = '''
INSERT INTO survey_summary (species_id, year, count) 
VALUES (?,?,?);
'''
cursor.execute(sql,values_list)
connection.commit()

In [96]:
sql = "SELECT * FROM survey_summary;"
cursor.execute(sql)
res = cursor.fetchall()
res[:10]

[(1, 'DM', 1960, 0)]

In [98]:
# This command retrieves the identifier of the last row from the most current query
# The gene_go_id

id_value = cursor.lastrowid
id_value

1

In [102]:
# the record in sqlite_sequence keep track of the autoincrement
sql = '''
SELECT *
FROM sqlite_sequence;
'''
cursor.execute(sql)
print(cursor.fetchall())

[('survey_summary', 1)]

In [104]:
values_list = [10, "DM",1961, 10]

sql = '''
INSERT INTO survey_summary (id, species_id, year, count) 
VALUES (?,?,?,?);
'''
cursor.execute(sql,values_list)
connection.commit()

In [106]:
id_value = cursor.lastrowid
id_value

10

In [108]:
sql = '''
SELECT *
FROM sqlite_sequence;
'''
cursor.execute(sql)
print(cursor.fetchall())

[('survey_summary', 10)]

In [110]:
values_list = [20, "DM",1962, 10]

sql = '''
INSERT INTO survey_summary  
VALUES (?,?,?,?);
'''
cursor.execute(sql,values_list)
connection.commit()

In [112]:
id_value = cursor.lastrowid
id_value

20

In [114]:
sql = '''
SELECT *
FROM sqlite_sequence;
'''
cursor.execute(sql)
print(cursor.fetchall())

[('survey_summary', 20)]

In [116]:
values_list = ["DM",1963, 30]

sql = '''
INSERT INTO survey_summary (species_id, year, count) 
VALUES (?,?,?);
'''
cursor.execute(sql,values_list)
connection.commit()

In [118]:
id_value = cursor.lastrowid
id_value

21

In [120]:
sql = '''
SELECT *
FROM sqlite_sequence;
'''
cursor.execute(sql)
print(cursor.fetchall())

[('survey_summary', 21)]

<br>


##### We have a row in the table!!! And the id was automatically generated.

In [125]:
sql = '''
SELECT *
FROM survey_summary ;
'''
cursor.execute(sql)
cursor.fetchall()

[(1, 'DM', 1960, 0),
 (10, 'DM', 1961, 10),
 (20, 'DM', 1962, 10),
 (21, 'DM', 1963, 30)]

#### You can have a Python "table" structure (list of lists) of insert values and get them all inserted in one command, each sublist having the correct number of values.

In [127]:
values_tbl = [["TEST",1950,2], ["TEST",1955,1], ["TEST",1974,2]]

sql = '''
INSERT INTO survey_summary (species_id, year, count) 
VALUES (?,?,?);
'''
cursor.executemany(sql,values_tbl)
connection.commit()

In [133]:
sql = '''
SELECT *
FROM survey_summary ;
'''
cursor.execute(sql)
cursor.fetchall()

[(1, 'DM', 1960, 0),
 (10, 'DM', 1961, 10),
 (20, 'DM', 1962, 10),
 (21, 'DM', 1963, 30),
 (22, 'TEST', 1950, 2),
 (23, 'TEST', 1955, 1),
 (24, 'TEST', 1974, 2)]

____

#### UPDATE - statement - changes the table rows

##### <font color="red"> This statement makes changes to the database</font>

MODIFIES DATA (already in a table)  in all rows matching the WHERE clause 

```sql
UPDATE table_name 
SET column1 = value1, column2 = value2...., columnN = valueN
WHERE [condition];
```

Update is generally a single row command, but use of the where clause can cause data to be updated in multiple rows <br>
(whether you intended to or not !!!!)

The following statement updates the evidence for all entries for all genes associated with the 2 biological processses

In [149]:
sql = "SELECT * FROM survey_summary WHERE species_id = 'TEST';"
df = run_query(cursor,sql)
df

Empty DataFrame
Columns: [id, species_id, year, count]
Index: []

In [145]:
# the following statement updates multiple rows
# before an update a select on the same table and 
# with the same where clause should be ran 
# to see the records that will be updated

sql = '''
UPDATE survey_summary
SET count = 20, species_id = "SP" 
WHERE species_id = "TEST";
'''
cursor.execute(sql)
connection.commit()

In [151]:
sql = '''
SELECT *
FROM survey_summary ;
'''
df = run_query(cursor,sql)
df

   id species_id  year  count
0   1         DM  1960      0
1  10         DM  1961     10
2  20         DM  1962     10
3  21         DM  1963     30
4  22         SP  1950     20
5  23         SP  1955     20
6  24         SP  1974     20

___

#### DELETE - statement - deletes table rows

* MAKES CHANGES TO THE DATA
* Row level deletion – can’t delete less than this. 

```sql
DELETE FROM <tablename> WHERE <column> = <value>
```

* The WHERE predicate is the same as for the SELECT statement, that is, it determines which rows will be deleted

In [155]:
sql = '''
SELECT * FROM survey_summary 
WHERE year < 1960;
'''
cursor.execute(sql)
cursor.fetchall()

[(22, 'SP', 1950, 20), (23, 'SP', 1955, 20)]

In [157]:
# before a delete statement a select on the same table and 
# with the same where clause should be ran to see the records 
# that will be removed

sql = '''
DELETE FROM survey_summary 
WHERE year < 1960;
'''
cursor.execute(sql)
connection.commit()

In [161]:
sql = '''
SELECT *
FROM survey_summary ;
'''
cursor.execute(sql)
cursor.fetchall()

[(1, 'DM', 1960, 0),
 (10, 'DM', 1961, 10),
 (20, 'DM', 1962, 10),
 (21, 'DM', 1963, 30),
 (24, 'SP', 1974, 20)]

```sql
DELETE FROM <tablename>; 
```

* This would delete all rows of data from a table.
* Preserves table structure (table still exists)
* Optimized for speed in SQLite, no row-by-row execution.
* EXISTS <table_name> still evaluates to True

In [163]:
# Delete all data from the table - but keep the table 

sql = '''
DELETE FROM survey_summary;
'''
cursor.execute(sql)
connection.commit()

In [167]:
sql = '''
SELECT *
FROM survey_summary ;
'''
cursor.execute(sql)
cursor.fetchall()

[]

<br>

#### `DROP TABLE` - statement - removes a table (permanently)

In [169]:
sql = '''
DROP TABLE IF EXISTS survey_summary;
'''
cursor.execute(sql)
connection.commit()

In [173]:
sql = '''
SELECT name AS "TABLE NAME"
FROM sqlite_master;
'''
cursor.execute(sql)
cursor.fetchall()

[('surveys',),
 ('species',),
 ('plots',),
 ('sqlite_sequence',),
 ('test_table',),
 ('test_column1_idx',),
 ('survey_test',)]

In [175]:
# we can create the summary with a select

sql = '''

SELECT species_id, year, count(record_id)
FROM surveys 
WHERE species_id <> "None"
GROUP BY species_id, year;'''
df = run_query(cursor,sql)
df

    species_id  year  count(record_id)
0           AB  1980                 5
1           AB  1981                 7
2           AB  1982                34
3           AB  1983                41
4           AB  1984                12
..         ...   ...               ...
504         UR  1994                 1
505         UR  2001                 2
506         UR  2002                 1
507         US  2002                 4
508         ZL  1988                 2

[509 rows x 3 columns]

#### VIEW in a database

* A view is a virtual table which can be created from a query on existing tables
* Views are created to give a more human readable version of the normalized data / tables
* http://www.sqlitetutorial.net/sqlite-create-view/
* An SQLite view is read only

```sql
CREATE [TEMP] VIEW [IF NOT EXISTS] view_name(column-name-list) AS    
select-statement;
```

In [177]:
# survey summary for years > 80 information for easy access
sql = '''
CREATE VIEW IF NOT EXISTS species_survey(species_id, species, year, counts) AS
SELECT sv.species_id, species, year, count(record_id)
FROM surveys AS sv
INNER JOIN species AS sp
ON sv.species_id = sp.species_id
WHERE sv.species_id <> "None"
GROUP BY sv.species_id,species, year


'''
cursor.execute(sql)
connection.commit()

In [181]:
# gene go information 
sql = '''
SELECT *
FROM species_survey
LIMIT 10;
'''
cursor.execute(sql)
df = run_query(cursor, sql)
df

  species_id    species  year  counts
0         AB  bilineata  1980       5
1         AB  bilineata  1981       7
2         AB  bilineata  1982      34
3         AB  bilineata  1983      41
4         AB  bilineata  1984      12
5         AB  bilineata  1985      14
6         AB  bilineata  1986       5
7         AB  bilineata  1987      35
8         AB  bilineata  1988      39
9         AB  bilineata  1989      31

In [185]:
sql = "SELECT name, type FROM sqlite_master;"
cursor.execute(sql)
cursor.fetchall()

[('surveys', 'table'),
 ('species', 'table'),
 ('plots', 'table'),
 ('sqlite_sequence', 'table'),
 ('test_table', 'table'),
 ('test_column1_idx', 'index'),
 ('survey_test', 'view'),
 ('species_survey', 'view')]

```sql
DROP VIEW [IF EXISTS] view_name;
```

In [193]:
# remove view from the database

sql = '''
DROP VIEW IF EXISTS species_survey;
'''
cursor.execute(sql)
connection.commit()

In [195]:
sql = "SELECT name, type FROM sqlite_master;"
cursor.execute(sql)
cursor.fetchall()

[('surveys', 'table'),
 ('species', 'table'),
 ('plots', 'table'),
 ('sqlite_sequence', 'table'),
 ('test_table', 'table'),
 ('test_column1_idx', 'index'),
 ('survey_test', 'view')]

In [197]:
# And close()

cursor.close()
connection.close()

#### To remove the database, delete the .sqlite file.